app/views/passengers/show.html.erb

SELECT "trips".* FROM "trips" WHERE "trips"."passenger_id" = $1  [["passenger_id", 48]]
---
  <ol>
    <% @passenger.all_trips.each do |trip| %>