app/controllers/drivers_controller.rb

  def get_driver
    @driver = Driver.find_by(id: params[:id].to_i)
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]

  def index
    @drivers = Driver.search(params[:term], params[:page])
---
SELECT COUNT(*) FROM "drivers"

  def status

    if @driver.status == true
      @driver.update(status: false)
    else
      @driver.update(status: true)
---
UPDATE "drivers" SET "status" = $1, "updated_at" = $2 WHERE "drivers"."id" = $3  [["status", false], ["updated_at", "2018-10-05 23:46:28.015712"], ["id", 88]]
UPDATE "drivers" SET "status" = $1, "updated_at" = $2 WHERE "drivers"."id" = $3  [["status", true], ["updated_at", "2018-10-07 03:57:40.548118"], ["id", 20]]