app/controllers/drivers_controller.rb

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "trips".* FROM "trips" WHERE "trips"."driver_id" = $1 ORDER BY "trips"."date" ASC  [["driver_id", 20]]
SELECT COUNT(*) FROM "trips" WHERE "trips"."driver_id" = $1  [["driver_id", 20]]
---
  def show
    @driver = Driver.find_by(id: params[:id])
        @driver_trips = @driver.trips.order("date").page(params[:page]).per_page(4)

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
  def edit
    @driver = Driver.find_by(id: params[:id])