app/controllers/drivers_controller.rb

SELECT  "drivers".* FROM "drivers" ORDER BY "drivers"."name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]
---
  def index
    @drivers = Driver.all.order(:name)