app/controllers/passengers_controller.rb

DELETE FROM "passengers" WHERE "passengers"."id" = $1  [["id", 301]]
---
    def destroy
      id = params[:id].to_i
      @passenger = Passenger.find_by(id: id)
      if @passenger.destroy