app/controllers/passengers_controller.rb

SELECT  "passengers".* FROM "passengers" WHERE (name LIKE '%%') ORDER BY "passengers"."name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]
---
  def index
    @passengers = Passenger.all.order(:name)

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
---
  def show
    id = params[:id].to_i
    @passenger = Passenger.find_by(id: id)

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
---
  def edit
    @passenger = Passenger.find(params[:id].to_i)

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 301], ["LIMIT", 1]]
---
  def destroy
    passenger = Passenger.find_by(id: params[:id].to_i)

INSERT INTO "passengers" ("name", "phone_num", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Abbey Sporaasd"], ["phone_num", "(712) 555-9368 x3557"], ["created_at", "2018-10-02 23:23:28.279336"], ["updated_at", "2018-10-02 23:23:28.279336"]]
---
  def create
    @passenger = Passenger.new(passenger_params)
    if @passenger.save

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
UPDATE "passengers" SET "name" = $1, "updated_at" = $2 WHERE "passengers"."id" = $3  [["name", "Abbey Spora"], ["updated_at", "2018-10-02 22:01:37.253881"], ["id", 48]]
---
  def update
    passenger = Passenger.find_by(id: params[:id].to_i)
    passenger.update(passenger_params)