app/controllers/passengers_controller.rb

  def index
    @passengers = Passenger.search(params[:term], params[:page])
---
SELECT  "passengers".* FROM "passengers" LIMIT $1  [["LIMIT", 11]]
SELECT COUNT(*) FROM "passengers" WHERE (name LIKE '%ab%')