app/controllers/trips_controller.rb

UPDATE "drivers" SET "status" = $1, "updated_at" = $2 WHERE "drivers"."id" = $3  [["status", false], ["updated_at", "2018-10-04 19:42:54.602783"], ["id", 1]]
INSERT INTO "trips" ("date", "cost", "created_at", "updated_at", "passenger_id", "driver_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2018-10-03"], ["cost", 0.0], ["created_at", "2018-10-03 22:34:54.735467"], ["updated_at", "2018-10-03 22:34:54.735467"], ["passenger_id", 48], ["driver_id", 1]]
---
  def create
    all_avail_drivers = Driver.where(available: true)
    first_avail_driver = all_avail_drivers.first

    passenger_id = params[:passenger_id]
    @trip = Trip.new(
      date: Date.today,
      rating: 0.0,
      cost: 0,
      driver_id: first_avail_driver.id,
      passenger_id: passenger_id
    )

    # Change driver's availability
    first_avail_driver.update(available: false)

    # prob need to manually enter the params in for at least driver id and passenger id
    # TODO: add availability column to driver db. default status: :unavailable
    # passenger = Passenger.find_by(id: params[passenger_id])
    # find first avail driver
    # avail_driver = Driver.find_by(status: :available)[0] OR Driver.find(status: :available)
    # avail_driver[status] = :unavailable or avail_driver.status = :unavailable i don't remember which
    # @trip = Trip.new(avail_driver.id)

    result = @trip.save