app/controllers/trips_controller.rb

  def show
    @trip = Trip.find_by(id: params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 281], ["LIMIT", 1]]

  def create
    if params[:passenger_id]
      passenger = Passenger.find_by(id: params[:passenger_id])
      driver = Driver.all.sample
      @trip = passenger.trips.new(driver_id: driver.id, passenger_id: passenger.id, date: "2017-02-02", rating: 0, cost: 0)

      if @trip.save
---
SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
INSERT INTO "trips" ("date", "cost", "created_at", "updated_at", "passenger_id", "driver_id", "in_progress") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["date", "2018-10-04"], ["cost", 0.0], ["created_at", "2018-10-04 19:59:13.457636"], ["updated_at", "2018-10-04 19:59:13.457636"], ["passenger_id", 108], ["driver_id", 8], ["in_progress", true]]

  def edit
    @trip = Trip.find_by(id: params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 602], ["LIMIT", 1]]

  def update
    trip = Trip.find(params[:id])
    trip.update(trip_params)
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 602], ["LIMIT", 1]]
UPDATE "trips" SET "in_progress" = $1, "cost" = $2, "rating" = $3, "updated_at" = $4 WHERE "trips"."id" = $5  [["in_progress", false], ["cost", 7178.0], ["rating", 3.0], ["updated_at", "2018-10-05 17:03:13.064003"], ["id", 612]]