app/views/drivers/show.html.erb

SELECT "trips".* FROM "trips" WHERE "trips"."driver_id" = $1  [["driver_id", 1]]
---
    <tr>
      <% @driver.trips.each do |trip| %>