app/models/driver.rb

SELECT "trips".* FROM "trips" WHERE "trips"."driver_id" = $1  [["driver_id", 1]]
---
  def total_earnings
  #The driver gets 80% of the trip cost after a fee of $1.65 is subtracted
    total_cost = self.trips.reduce(0) { |sum, trip|
      if trip.cost == nil
        sum + 0
      else
        sum + trip.cost
      end
      }
    num_trips = self.trips.length

SELECT COUNT(*) FROM "trips" WHERE "trips"."driver_id" = $1  [["driver_id", 20]]
---
  def average_rating
    sum_rating = self.trips.reduce(0) { |sum, trip|
      if trip.rating == nil
        sum + 0
      else
        sum + trip.rating
      end
    }
    num_trips = self.trips.length.to_f