app/models/passenger.rb

SELECT "trips".* FROM "trips" WHERE "trips"."passenger_id" = $1  [["passenger_id", 185]]
---
  def total_cost
    total = 0
    self.trips.each do |trip|

SELECT "trips".* FROM "trips" WHERE "trips"."passenger_id" = $1  [["passenger_id", 48]]
---
  def list_trips
    trips = []
    self.trips.each do |trip|