app/models/trip.rb

  def end_trip(rating)
    driver = Driver.find(self.driver_id)
    if rating != nil
      self.in_progress = false
      self.cost = rand(9999) if self.cost == 0
      driver.status = true
      driver.save
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "drivers" SET "status" = $1, "updated_at" = $2 WHERE "drivers"."id" = $3  [["status", true], ["updated_at", "2018-10-05 17:02:55.866885"], ["id", 9]]